{
  "choreographers": [
    {
      "id": "choreo-001",
      "name": "Billy Cohen",
      "role": "choreographer",
      "username": "billycohen",
      "pronouns": "he/him",
      "bio": "Billy Cohen, hailing from the Greater Boston area, started his dance training with hip-hop at the age of six with his identical twin brother, and continued his training in ballet and modern at Hofstra University while receiving a B.S. Degree in Dance Education.",
      "socialLinks": {
        "instagram": "@billycohen_"
      },
      "profilePhoto": "/images/billy.jpg",
      "featuredVideo": "https://www.youtube.com/watch?v=HoT8RSbYhbM",
      "achievements": [
        "bloc NYC, bloc LA",
        "Broadway Dance Center - Tutting (Mondays)",
        "BTS | JBalvin & Bad Bunny | Marvelous Mrs Maisel | Vogue | etc"
      ],
      "teachingStyle": "Billy Cohen, hailing from the Greater Boston area, started his dance training with hip-hop at the age of six with his identical twin brother, and continued his training in ballet and modern at Hofstra University while receiving a B.S. Degree in Dance Education.",
      "upcomingClasses": ["class-001", "class-003", "class-006"]
    },
    {
      "id": "choreo-002", 
      "name": "Phil Colgan",
      "role": "choreographer",
      "username": "philcolgan",
      "pronouns": "he/him",
      "bio": "Phil Colgan is a choreographer, performer, and dance educator born and raised in NYC. Phil won a pre-show on-stage dance contest at the Broadway revival of Grease in 1997 and hasn't shut up about it since. ",
      "website": "https://philcolgan.com",
      "socialLinks": {
        "instagram": "@philcolgan",
        "tiktok": "@philcolgan",
        "youtube": "PhilColgan"
      },
      "profilePhoto": "/images/phil.jpg",
      "featuredVideo": "https://youtu.be/9bZkp7q19f0",
      "achievements": [
        "Represented by Daniel Hoff Agency Inc",
        "Teaches at Broadway Dance Center and Steps on Broadway",
        "Hamilton | & Juliet | New York New York"
      ],
      "teachingStyle": "Phil's class lives in a cross-section of theatricality, musicality, style/technique, and showmanship. After a jazz-based warm-up structured to engage the body and focus minds, dancers will learn choreography in one of the various styles that musical theater requires of them in the contemporary landscape. Phil aims to help dancers understand how music and its intricacy can inform character and storytelling, all while giving them the space to explore different ways of approaching theater dance—and hopefully having fun on the way.",
      "upcomingClasses": ["class-002", "class-005", "class-007", "class-009"]
    },
    {
      "id": "choreo-003",
      "name": "Madison Hilligoss",
      "role": "choreographer", 
      "username": "madisonhilligoss",
      "pronouns": "she/her",
      "bio": "I'm a NYC-based multidisciplinary artist, teacher, and creative hailing from Minnesota— my primary mode of expression is tap dance. My personal and professional interests converge around acoustic, embodied, and percussive music-making, collective identity, arts education, and language.",
      "website": "https://madisonhilligoss.com/",
      "profilePhoto": "/images/madison.jpg",
      "socialLinks": {
        "instagram": "@madisonhilligoss",
        "youtube": "MadisonHilligoss"
      },
      "featuredVideo": "https://youtu.be/u2lNrTXGKvo",
      "achievements": [
        "The Tap Dance Kid | Lights Out: Nat King Cole | Funny Girl"
      ],
      "teachingStyle": "My classes are all rooted in the premise that as tap dancers, we are musicians, so our responsibility is to make and respond to music with intention and curiosity. Class will typically begin with a warm up to build strength, coordination, and muscle memory, followed by a series of call-and-response exercises in the center with a focus on rhythmic accuracy and alignment/technique. The remainder of class includes a combination of across-the-floor exercises, technique drills, sometimes improvisation, and typically the last section of class is dedicated to learning a combination to practice retaining and performing choreography. I strive to create a welcoming class environment that is conducive to learning, experimenting, and growing. All are welcome in my class.",
      "upcomingClasses": ["class-004", "class-008", "class-010"]
    }
  ]
}